WAGE_EFF_TABLE = {
    100: (20, 600),
    200: (30, 900),
    300: (50, 1500),
    400: (80, 2400),
    500: (120, 3600),
    600: (170, 5100),
    700: (230, 6900),
    800: (300, 9000),
    900: (380, 11400),
    1000: (500, 15000),
    1100: (600, 18000),
    1200: (700, 21000),
    1300: (800, 24000),
    1400: (900, 27000),
    1500: (1000, 30000),
    1600: (1100, 33000),
    1700: (1200, 36000),
    1800: (1300, 39000),
    1900: (1400, 42000),
    2000: (1500, 45000),
    2100: (1600, 48000),
    2200: (1700, 51000),
    2300: (1800, 54000),
    2400: (1900, 57000),
    2500: (2000, 60000),
    2600: (2100, 63000),
    2700: (2200, 66000),
    2800: (2300, 69000),
    2900: (2400, 72000),
    3000: (2500, 75000),
}

FACILITY_MAX_QTY = 30000

FACILITY_URL = "https://gerniverse.app/facility"

_KOREAN_UNIT_MAP = {
    "천": 1_000,
    "만": 10_000,
    "십만": 100_000,
    "백만": 1_000_000,
    "천만": 10_000_000,
    "억": 100_000_000,
}

CATEGORY_URLS = {
    "연금술사": "https://www.gersangjjang.com/zhizuo/skill_lianjin.asp",
    "세공사": "https://www.gersangjjang.com/zhizuo/skill_xigongshi.asp",
    "대장장이": "https://www.gersangjjang.com/zhizuo/skill_tiejiang.asp",
}

FACILITY_DEFAULT_COUNTRIES = ["조선", "일본", "대만", "중국"]  # ✅ 몽골 제외

FACILITY_SUBCATEGORY_MAP = {
    "무기장": [
        "궁포공장", "도검공장", "무선공장", "부월공장", "불무공장",
        "암기공장", "조도공장", "창극공장", "총포공장", "특수무기공장"
    ],
    "공장": [
        "공예장", "대장간", "도요지", "제약장", "직조장"
    ],
    "목장": [
        "도축장", "제약장", "축사"
    ]
}